{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_regularizer": null, "batch_input_shape": [null, 10], "name": "dense_1", "units": 64, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 64, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}